// Пользователь вводит текстовую строку. Определить с
// помощью регулярного выражения, является ли
// введённая строка:
// 1.Датой.
// 2.Адресом электронной почты.
// 3.*Номером телефона

{
    const str = prompt('Введите значение: ');
    const dateRegexp = /^(0[1-9]|[12][0-9]|3[0-1])\.(0[1-9]|1[0-2])\.(0[0-9]{2}[1-9]{1}|[1-9]{1}[0-9]{3})$/;
    const emailRegexp = /^(\w+)@([a-z]{2,})\.([a-z]{2,})$/;
    const phoneRegexp = /^(8|\+?7)\-?(9[0-9]{2})\-?([0-9]{3})\-?([0-9]{2})\-?([0-9]{2})$/;

    if (dateRegexp.test(str)) {
        console.log('Введенное значение является датой');
    } else if (emailRegexp.test(str)) {
        console.log('Введенное значение является электронным адресом');
    } else if (phoneRegexp.test(str)) {
        console.log('Введенное значение является телефоном');
    } else {
        console.log('Введенное значение некорректно');
    }
}